# Point Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
LocationPoint..::..Point Property
LocationPoint Class Example See Also
---
The physical location of the element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public XYZ Point { get; set; }
```

Visual Basic
---
```text
Public Property Point As XYZ
	Get
	Set
```

Visual C++
---
```text
public:
property XYZ^ Point {
	XYZ^ get ();
	void set (XYZ^ value);
}
```

# Remarks
Setting this property is not supported for some elements supporting LocationPoints, such as SpotDimensions.
# Examples
CopyC#
```text
void LocationMove(FamilyInstance column)
{
    LocationPoint columnPoint = column.Location as LocationPoint;
    if (null != columnPoint)
    {
        XYZ newLocation = new XYZ(10, 20, 0);
        // Move the column to the new location
        columnPoint.Point = newLocation;
    }
}
```

CopyVB.NET
```text
Private Sub LocationMove(column As FamilyInstance)
    Dim columnPoint As LocationPoint = TryCast(column.Location, LocationPoint)
    If columnPoint IsNot Nothing Then
        Dim newLocation As New XYZ(10, 20, 0)
        ' Move the column to the new location
        columnPoint.Point = newLocation
    End If
End Sub
```

# See Also
LocationPoint Class
Autodesk.Revit.DB Namespace